tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/verticalChannel/0.org/omega
/*------------------------------*- FOAMDict -*-------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   uniform 4.5e-3;

boundaryField
{
    back
    {
        type            symmetryPlane;
    }
    front
    {
        type            symmetryPlane;
    }
    inletCentral
    {
        type            compressible::turbulentMixingLengthFrequencyInlet;
        mixingLength    0.007;
        k               k;
        value           uniform 4.5e-3;
    }
    inletSides
    {
        type            compressible::turbulentMixingLengthFrequencyInlet;
        mixingLength    0.007;
        k               k;
        value           uniform 4.5e-3;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 4.5e-3;
    }
    walls
    {
        type            compressible::omegaWallFunction;
        Cmu             0.09;
        kappa           0.41;
        E               9.8;
        value           uniform 0;
    }
}


// ****************** vim: set ft=foamdict sw=4 sts=4 et: ****************** //
