tutorials/lagrangian/porousExplicitSourceReactingParcelFoam/verticalChannel/Allrun.py.in
#!@PYTHON_EXECUTABLE@

import sys
import os
import os.path
sys.path.insert(0, '@FOAM_PYTHON_DIR@')
from FreeFOAM.compat import *
import FreeFOAM.tutorial
import FreeFOAM.util

class PESRPVerticalChannelRunner(FreeFOAM.tutorial.CaseRunner):
   def __init__(self):
      FreeFOAM.tutorial.CaseRunner.__init__(self, 'PESRP_verticalChannel')
      self.add_app_step('blockMesh')
      self.add_app_step('potential')
      self.add_step('prepare', self._prepare)
      self.add_app_step('porousExplicitSourceReactingParcel')

   def clean(self):
      FreeFOAM.tutorial.CaseRunner.clean(self)
      zero = os.path.join(self.case_dir, '0')
      FreeFOAM.util.copytree(zero+'.org', zero)
      FreeFOAM.util.rmtree(os.path.join(self.case_dir, 'postProcessing'))

   def _prepare(self, case_dir, stamp_file, test_mode):
      try:
         stamp_file.write('Removing 0/phi.\n')
         FreeFOAM.util.rmtree(os.path.join(case_dir, '0', 'phi'))
         stamp_file.write('RESULT: SUCCESS\n')
         return True
      except Exception:
         e = sys.exc_info()[1]
         stamp_file.write('*** Error *** '+str(e)+'\nRESULT: FAILURE\n')
         return False

if __name__ == '__main__':
   os.chdir(os.path.abspath(os.path.dirname(sys.argv[0])))
   runner = FreeFOAM.tutorial.TutorialRunner()
   runner.add_case(PESRPVerticalChannelRunner())
   sys.exit(runner.main())

# ------------------- vim: set sw=3 sts=3 ft=python et: ------------ end-of-file
